kholia/hal_wch/ch32fun/ch32l103hw.h
#define ADC_JL                                  ((uint32_t)0x00300000) /* JL[1:0] bits (Injected Sequence length) */
#define ADC_JL_0                                ((uint32_t)0x00100000) /* Bit 0 */
#define ADC_JL_1                                ((uint32_t)0x00200000) /* Bit 1 */

/*******************  Bit definition for ADC_IDATAR1 register  *******************/
#define ADC_IDATAR1_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/*******************  Bit definition for ADC_IDATAR2 register  *******************/
#define ADC_IDATAR2_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/*******************  Bit definition for ADC_IDATAR3 register  *******************/
#define ADC_IDATAR3_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/*******************  Bit definition for ADC_IDATAR4 register  *******************/
#define ADC_IDATAR4_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/********************  Bit definition for ADC_RDATAR register  ********************/
#define ADC_RDATAR_DATA                         ((uint32_t)0x0000FFFF) /* Regular data */

/********************  Bit definition for ADC_CFG register  ********************/
#define ADC_BUFTRIM                             ((uint32_t)0x0000000F) /* BUFTRIM[3:0] bits */
#define ADC_BUFTRIM_0                           ((uint32_t)0x00000001)
#define ADC_BUFTRIM_1                           ((uint32_t)0x00000002)
#define ADC_BUFTRIM_2                           ((uint32_t)0x00000004)
#define ADC_BUFTRIM_3                           ((uint32_t)0x00000008)

#define ADC_AWDRST_EN                           ((uint32_t)0x00000010)
#define ADC_LP                                  ((uint32_t)0x00000020)
#define ADC_FIFO_EN                             ((uint32_t)0x00000040)
#define ADC_DUTY_EN                             ((uint32_t)0x00000080)
#define ADC_TKEY_DRV_EN                         ((uint32_t)0x00000100)

#define ADC_TKEY_DRV_OUTEN                      ((uint32_t)0x0007FE00) /* TKEY_DRV_OUTEN[9:0] bits */
#define ADC_TKEY_DRV_OUTEN_0                    ((uint32_t)0x00000200)
#define ADC_TKEY_DRV_OUTEN_1                    ((uint32_t)0x00000400)
#define ADC_TKEY_DRV_OUTEN_2                    ((uint32_t)0x00000800)
#define ADC_TKEY_DRV_OUTEN_3                    ((uint32_t)0x00001000)
#define ADC_TKEY_DRV_OUTEN_4                    ((uint32_t)0x00002000)
#define ADC_TKEY_DRV_OUTEN_5                    ((uint32_t)0x00004000)
#define ADC_TKEY_DRV_OUTEN_6                    ((uint32_t)0x00008000)
#define ADC_TKEY_DRV_OUTEN_7                    ((uint32_t)0x00010000)
#define ADC_TKEY_DRV_OUTEN_8                    ((uint32_t)0x00020000)
#define ADC_TKEY_DRV_OUTEN_9                    ((uint32_t)0x00040000)

#define ADC_TKEY_SEL                            ((uint32_t)0x00180000) /* TKEY_SEL[1:0] bits */
#define ADC_TKEY_SEL_0                          ((uint32_t)0x00080000)
#define ADC_TKEY_SEL_1                          ((uint32_t)0x00080000)

#define ADC_TKEY_WAKE_EN                        ((uint32_t)0x8FE00000) /* TKEY_WAKE_EN[9:0] bits */
#define ADC_TKEY_WAKE_EN_0                      ((uint32_t)0x00200000)
#define ADC_TKEY_WAKE_EN_1                      ((uint32_t)0x00400000)
#define ADC_TKEY_WAKE_EN_2                      ((uint32_t)0x00800000)
#define ADC_TKEY_WAKE_EN_3                      ((uint32_t)0x01000000)
#define ADC_TKEY_WAKE_EN_4                      ((uint32_t)0x02000000)
#define ADC_TKEY_WAKE_EN_5                      ((uint32_t)0x04000000)
#define ADC_TKEY_WAKE_EN_6                      ((uint32_t)0x08000000)
#define ADC_TKEY_WAKE_EN_7                      ((uint32_t)0x10000000)
#define ADC_TKEY_WAKE_EN_8                      ((uint32_t)0x20000000)
#define ADC_TKEY_WAKE_EN_9                      ((uint32_t)0x40000000)

/******************************************************************************/
/*                            Backup registers                                */
/******************************************************************************/

/*******************  Bit definition for BKP_DATAR1 register  ********************/
#define BKP_DATAR1_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR2 register  ********************/
#define BKP_DATAR2_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR3 register  ********************/
#define BKP_DATAR3_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR4 register  ********************/
#define BKP_DATAR4_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR5 register  ********************/
#define BKP_DATAR5_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR6 register  ********************/
#define BKP_DATAR6_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR7 register  ********************/
#define BKP_DATAR7_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR8 register  ********************/
#define BKP_DATAR8_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR9 register  ********************/
#define BKP_DATAR9_D                            ((uint16_t)0xFFFF) /* Backup data */

/*******************  Bit definition for BKP_DATAR10 register  *******************/
#define BKP_DATAR10_D                           ((uint16_t)0xFFFF) /* Backup data */

/******************  Bit definition for BKP_OCTLR register  *******************/
#define BKP_CAL                                 ((uint16_t)0x007F) /* Calibration value */
#define BKP_CCO                                 ((uint16_t)0x0080) /* Calibration Clock Output */
#define BKP_ASOE                                ((uint16_t)0x0100) /* Alarm or Second Output Enable */
#define BKP_ASOS                                ((uint16_t)0x0200) /* Alarm or Second Output Selection */

/********************  Bit definition for BKP_TPCTLR register  ********************/
#define BKP_TPE                                 ((uint8_t)0x01) /* TAMPER pin enable */
#define BKP_TPAL                                ((uint8_t)0x02) /* TAMPER pin active level */

/*******************  Bit definition for BKP_TPCSR register  ********************/
#define BKP_CTE                                 ((uint16_t)0x0001) /* Clear Tamper event */
#define BKP_CTI                                 ((uint16_t)0x0002) /* Clear Tamper Interrupt */
#define BKP_TPIE                                ((uint16_t)0x0004) /* TAMPER Pin interrupt enable */
#define BKP_TEF                                 ((uint16_t)0x0100) /* Tamper Event Flag */
#define BKP_TIF                                 ((uint16_t)0x0200) /* Tamper Interrupt Flag */

/******************************************************************************/
/*                         Controller Area Network                            */
/******************************************************************************/

