kholia/hal_wch/ch32fun/ch32l103hw.h
/* CANFD_synchronisation_jump_width */
#define CANFD_SJW_1tq                          ((uint8_t)0x00) /* 1 time quantum */
#define CANFD_SJW_2tq                          ((uint8_t)0x01) /* 2 time quantum */
#define CANFD_SJW_3tq                          ((uint8_t)0x02) /* 3 time quantum */
#define CANFD_SJW_4tq                          ((uint8_t)0x03) /* 4 time quantum */
#define CANFD_SJW_5tq                          ((uint8_t)0x04) /* 5 time quantum */
#define CANFD_SJW_6tq                          ((uint8_t)0x05) /* 6 time quantum */
#define CANFD_SJW_7tq                          ((uint8_t)0x06) /* 7 time quantum */
#define CANFD_SJW_8tq                          ((uint8_t)0x07) /* 8 time quantum */
#define CANFD_SJW_9tq                          ((uint8_t)0x08) /* 9 time quantum */
#define CANFD_SJW_10tq                         ((uint8_t)0x09) /* 10 time quantum */
#define CANFD_SJW_11tq                         ((uint8_t)0x0A) /* 11 time quantum */
#define CANFD_SJW_12tq                         ((uint8_t)0x0B) /* 12 time quantum */
#define CANFD_SJW_13tq                         ((uint8_t)0x0C) /* 13 time quantum */
#define CANFD_SJW_14tq                         ((uint8_t)0x0D) /* 14 time quantum */
#define CANFD_SJW_15tq                         ((uint8_t)0x0E) /* 15 time quantum */
#define CANFD_SJW_16tq                         ((uint8_t)0x0F) /* 16 time quantum */

/* CANFD_time_quantum_in_bit_segment_1 */
#define CANFD_BS1_1tq                         ((uint8_t)0x00) /* 1 time quantum */
#define CANFD_BS1_2tq                         ((uint8_t)0x01) /* 2 time quantum */
#define CANFD_BS1_3tq                         ((uint8_t)0x02) /* 3 time quantum */
#define CANFD_BS1_4tq                         ((uint8_t)0x03) /* 4 time quantum */
#define CANFD_BS1_5tq                         ((uint8_t)0x04) /* 5 time quantum */
#define CANFD_BS1_6tq                         ((uint8_t)0x05) /* 6 time quantum */
#define CANFD_BS1_7tq                         ((uint8_t)0x06) /* 7 time quantum */
#define CANFD_BS1_8tq                         ((uint8_t)0x07) /* 8 time quantum */
#define CANFD_BS1_9tq                         ((uint8_t)0x08) /* 9 time quantum */
#define CANFD_BS1_10tq                        ((uint8_t)0x09) /* 10 time quantum */
#define CANFD_BS1_11tq                        ((uint8_t)0x0A) /* 11 time quantum */
#define CANFD_BS1_12tq                        ((uint8_t)0x0B) /* 12 time quantum */
#define CANFD_BS1_13tq                        ((uint8_t)0x0C) /* 13 time quantum */
#define CANFD_BS1_14tq                        ((uint8_t)0x0D) /* 14 time quantum */
#define CANFD_BS1_15tq                        ((uint8_t)0x0E) /* 15 time quantum */
#define CANFD_BS1_16tq                        ((uint8_t)0x0F) /* 16 time quantum */
#define CANFD_BS1_17tq                         ((uint8_t)0x10) /* 17 time quantum */
#define CANFD_BS1_18tq                         ((uint8_t)0x11) /* 18 time quantum */
#define CANFD_BS1_19tq                         ((uint8_t)0x12) /* 19 time quantum */
#define CANFD_BS1_20tq                         ((uint8_t)0x13) /* 20 time quantum */
#define CANFD_BS1_21tq                         ((uint8_t)0x14) /* 21 time quantum */
#define CANFD_BS1_22tq                         ((uint8_t)0x15) /* 22 time quantum */
#define CANFD_BS1_23tq                         ((uint8_t)0x16) /* 23 time quantum */
#define CANFD_BS1_24tq                         ((uint8_t)0x17) /* 24 time quantum */
#define CANFD_BS1_25tq                         ((uint8_t)0x18) /* 25 time quantum */
#define CANFD_BS1_26tq                         ((uint8_t)0x19) /* 26 time quantum */
#define CANFD_BS1_27tq                         ((uint8_t)0x1A) /* 27 time quantum */
#define CANFD_BS1_28tq                         ((uint8_t)0x1B) /* 28 time quantum */
#define CANFD_BS1_29tq                         ((uint8_t)0x1C) /* 29 time quantum */
#define CANFD_BS1_30tq                         ((uint8_t)0x1D) /* 30 time quantum */
#define CANFD_BS1_31tq                         ((uint8_t)0x1E) /* 31 time quantum */
#define CANFD_BS1_32tq                         ((uint8_t)0x1F) /* 32 time quantum */

/* CANFD_time_quantum_in_bit_segment_2 */
#define CANFD_BS2_1tq                          ((uint8_t)0x00) /* 1 time quantum */
#define CANFD_BS2_2tq                          ((uint8_t)0x01) /* 2 time quantum */
#define CANFD_BS2_3tq                          ((uint8_t)0x02) /* 3 time quantum */
#define CANFD_BS2_4tq                          ((uint8_t)0x03) /* 4 time quantum */
#define CANFD_BS2_5tq                          ((uint8_t)0x04) /* 5 time quantum */
#define CANFD_BS2_6tq                          ((uint8_t)0x05) /* 6 time quantum */
#define CANFD_BS2_7tq                          ((uint8_t)0x06) /* 7 time quantum */
#define CANFD_BS2_8tq                          ((uint8_t)0x07) /* 8 time quantum */
#define CANFD_BS2_9tq                          ((uint8_t)0x08) /* 9 time quantum */
#define CANFD_BS2_10tq                         ((uint8_t)0x09) /* 10 time quantum */
#define CANFD_BS2_11tq                         ((uint8_t)0x0A) /* 11 time quantum */
#define CANFD_BS2_12tq                         ((uint8_t)0x0B) /* 12 time quantum */
#define CANFD_BS2_13tq                         ((uint8_t)0x0C) /* 13 time quantum */
#define CANFD_BS2_14tq                         ((uint8_t)0x0D) /* 14 time quantum */
#define CANFD_BS2_15tq                         ((uint8_t)0x0E) /* 15 time quantum */
#define CANFD_BS2_16tq                         ((uint8_t)0x0F) /* 16 time quantum */

/* CAN_Transmit_Mailbox_number_constants */
#define CAN_Transmit_Mailbox0               ((uint8_t)0x00)
#define CAN_Transmit_Mailbox1               ((uint8_t)0x01)
#define CAN_Transmit_Mailbox2               ((uint8_t)0x02)


/* ch32v00x_dac.h ------------------------------------------------------------*/

/* DAC_trigger_selection */
#define DAC_Trigger_None                   ((uint32_t)0x00000000) /* Conversion is automatic once the DAC1_DHRxxxx register
                                                                     has been loaded, and not by external trigger */
#define DAC_Trigger_T6_TRGO                ((uint32_t)0x00000004) /* TIM6 TRGO selected as external conversion trigger for DAC channel */
#define DAC_Trigger_T8_TRGO                ((uint32_t)0x0000000C) /* TIM8 TRGO selected as external conversion trigger for DAC channel
                                                                     only in High-density devices*/
#define DAC_Trigger_T7_TRGO                ((uint32_t)0x00000014) /* TIM7 TRGO selected as external conversion trigger for DAC channel */
#define DAC_Trigger_T5_TRGO                ((uint32_t)0x0000001C) /* TIM5 TRGO selected as external conversion trigger for DAC channel */
#define DAC_Trigger_T2_TRGO                ((uint32_t)0x00000024) /* TIM2 TRGO selected as external conversion trigger for DAC channel */
#define DAC_Trigger_T4_TRGO                ((uint32_t)0x0000002C) /* TIM4 TRGO selected as external conversion trigger for DAC channel */
#define DAC_Trigger_Ext_IT9                ((uint32_t)0x00000034) /* EXTI Line9 event selected as external conversion trigger for DAC channel */
#define DAC_Trigger_Software               ((uint32_t)0x0000003C) /* Conversion started by software trigger for DAC channel */

/* DAC_wave_generation */
#define DAC_WaveGeneration_None            ((uint32_t)0x00000000)
#define DAC_WaveGeneration_Noise           ((uint32_t)0x00000040)
#define DAC_WaveGeneration_Triangle        ((uint32_t)0x00000080)


/* DAC_lfsrunmask_triangleamplitude */
#define DAC_LFSRUnmask_Bit0                ((uint32_t)0x00000000) /* Unmask DAC channel LFSR bit0 for noise wave generation */
#define DAC_LFSRUnmask_Bits1_0             ((uint32_t)0x00000100) /* Unmask DAC channel LFSR bit[1:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits2_0             ((uint32_t)0x00000200) /* Unmask DAC channel LFSR bit[2:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits3_0             ((uint32_t)0x00000300) /* Unmask DAC channel LFSR bit[3:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits4_0             ((uint32_t)0x00000400) /* Unmask DAC channel LFSR bit[4:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits5_0             ((uint32_t)0x00000500) /* Unmask DAC channel LFSR bit[5:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits6_0             ((uint32_t)0x00000600) /* Unmask DAC channel LFSR bit[6:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits7_0             ((uint32_t)0x00000700) /* Unmask DAC channel LFSR bit[7:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits8_0             ((uint32_t)0x00000800) /* Unmask DAC channel LFSR bit[8:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits9_0             ((uint32_t)0x00000900) /* Unmask DAC channel LFSR bit[9:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits10_0            ((uint32_t)0x00000A00) /* Unmask DAC channel LFSR bit[10:0] for noise wave generation */
#define DAC_LFSRUnmask_Bits11_0            ((uint32_t)0x00000B00) /* Unmask DAC channel LFSR bit[11:0] for noise wave generation */
#define DAC_TriangleAmplitude_1            ((uint32_t)0x00000000) /* Select max triangle amplitude of 1 */
#define DAC_TriangleAmplitude_3            ((uint32_t)0x00000100) /* Select max triangle amplitude of 3 */
#define DAC_TriangleAmplitude_7            ((uint32_t)0x00000200) /* Select max triangle amplitude of 7 */
#define DAC_TriangleAmplitude_15           ((uint32_t)0x00000300) /* Select max triangle amplitude of 15 */
#define DAC_TriangleAmplitude_31           ((uint32_t)0x00000400) /* Select max triangle amplitude of 31 */
#define DAC_TriangleAmplitude_63           ((uint32_t)0x00000500) /* Select max triangle amplitude of 63 */
#define DAC_TriangleAmplitude_127          ((uint32_t)0x00000600) /* Select max triangle amplitude of 127 */
#define DAC_TriangleAmplitude_255          ((uint32_t)0x00000700) /* Select max triangle amplitude of 255 */
#define DAC_TriangleAmplitude_511          ((uint32_t)0x00000800) /* Select max triangle amplitude of 511 */
#define DAC_TriangleAmplitude_1023         ((uint32_t)0x00000900) /* Select max triangle amplitude of 1023 */
#define DAC_TriangleAmplitude_2047         ((uint32_t)0x00000A00) /* Select max triangle amplitude of 2047 */
#define DAC_TriangleAmplitude_4095         ((uint32_t)0x00000B00) /* Select max triangle amplitude of 4095 */

/* DAC_output_buffer */
#define DAC_OutputBuffer_Enable            ((uint32_t)0x00000000)
#define DAC_OutputBuffer_Disable           ((uint32_t)0x00000002)

/* DAC_Channel_selection */
#define DAC_Channel_1                      ((uint32_t)0x00000000)
#define DAC_Channel_2                      ((uint32_t)0x00000010)

/* DAC_data_alignment */
#define DAC_Align_12b_R                    ((uint32_t)0x00000000)
#define DAC_Align_12b_L                    ((uint32_t)0x00000004)
#define DAC_Align_8b_R                     ((uint32_t)0x00000008)

/* DAC_wave_generation */
#define DAC_Wave_Noise                     ((uint32_t)0x00000040)
#define DAC_Wave_Triangle                  ((uint32_t)0x00000080)

/* ch32v00x_dbgmcu.h ---------------------------------------------------------*/

/* CFGR0 Register */
#define DBGMCU_SLEEP                 ((uint32_t)0x00000001)
#define DBGMCU_STOP                  ((uint32_t)0x00000002)
#define DBGMCU_STANDBY               ((uint32_t)0x00000004)
#define DBGMCU_IWDG_STOP             ((uint32_t)0x00000100)
#define DBGMCU_WWDG_STOP             ((uint32_t)0x00000200)
#define DBGMCU_I2C1_SMBUS_TIMEOUT    ((uint32_t)0x00000400)
#define DBGMCU_I2C2_SMBUS_TIMEOUT    ((uint32_t)0x00000800)
#define DBGMCU_TIM1_STOP             ((uint32_t)0x00001000)
#define DBGMCU_TIM2_STOP             ((uint32_t)0x00002000)
#define DBGMCU_TIM3_STOP             ((uint32_t)0x00004000)
#define DBGMCU_TIM4_STOP             ((uint32_t)0x00008000)
#define DBGMCU_TIM5_STOP             ((uint32_t)0x00010000)
#define DBGMCU_TIM6_STOP             ((uint32_t)0x00020000)
#define DBGMCU_TIM7_STOP             ((uint32_t)0x00040000)
#define DBGMCU_TIM8_STOP             ((uint32_t)0x00080000)
#define DBGMCU_CAN1_STOP             ((uint32_t)0x00100000)
#define DBGMCU_CAN2_STOP             ((uint32_t)0x00200000)
#define DBGMCU_TIM9_STOP             ((uint32_t)0x00400000)
#define DBGMCU_TIM10_STOP            ((uint32_t)0x00800000)

/* ch32v00x_dma.h ------------------------------------------------------------*/

/* DMA_data_transfer_direction */
#define DMA_DIR_PeripheralDST              ((uint32_t)0x00000010)
#define DMA_DIR_PeripheralSRC              ((uint32_t)0x00000000)

/* DMA_peripheral_incremented_mode */
#define DMA_PeripheralInc_Enable           ((uint32_t)0x00000040)
#define DMA_PeripheralInc_Disable          ((uint32_t)0x00000000)

/* DMA_memory_incremented_mode */
#define DMA_MemoryInc_Enable               ((uint32_t)0x00000080)
#define DMA_MemoryInc_Disable              ((uint32_t)0x00000000)

/* DMA_peripheral_data_size */
#define DMA_PeripheralDataSize_Byte        ((uint32_t)0x00000000)
#define DMA_PeripheralDataSize_HalfWord    ((uint32_t)0x00000100)
#define DMA_PeripheralDataSize_Word        ((uint32_t)0x00000200)

/* DMA_memory_data_size */
#define DMA_MemoryDataSize_Byte            ((uint32_t)0x00000000)
#define DMA_MemoryDataSize_HalfWord        ((uint32_t)0x00000400)
#define DMA_MemoryDataSize_Word            ((uint32_t)0x00000800)

